salinraj/amigo/syringe pump/src/stm32f1xx_LCD.c
}
void LCD_Delay(uint32_t Delay)
{
  //HAL_Delay(Delay);
		for (; Delay > 0; Delay-- )
	{
	__asm("nop");
	}
}



void LCD_WriteRegister16(uint16_t LCDReg, uint16_t LCDRegValue)
{
  LCD_IO_WriteReg(LCDReg);
  LCD_IO_WriteMultipleData(&LCDRegValue, 1);
}








//**************************************************************************************

/********************************* LINK LCD ***********************************/
/**
  * @brief  Initializes the LCD
  * @retval None
  */
void LCD_IO_Init(void)
{ 

	GPIO_InitTypeDef  gpioinitstruct = {0};

  /* LCD_CS_GPIO and LCD_DC_GPIO Periph clock enable */
  LCD_CS_GPIO_CLK_ENABLE();
  LCD_DC_GPIO_CLK_ENABLE();
	LCD_RW_GPIO_CLK_ENABLE() ;
  
  /* Configure LCD_CS_PIN pin: LCD Card CS pin */
  gpioinitstruct.Pin    = LCD_CS_PIN;
  gpioinitstruct.Mode   = GPIO_MODE_OUTPUT_PP;
  gpioinitstruct.Speed  = GPIO_SPEED_HIGH;
  HAL_GPIO_Init(LCD_CS_GPIO_PORT, &gpioinitstruct);
      
  /* Configure LCD_DC_PIN pin: LCD Card DC pin */
  gpioinitstruct.Pin    = LCD_DC_PIN;
  HAL_GPIO_Init(LCD_DC_GPIO_PORT, &gpioinitstruct);
  /* Configure LCD_RW_PIN pin: LCD Card DC pin */
  gpioinitstruct.Pin = LCD_RW_PIN;
  HAL_GPIO_Init(LCD_RW_GPIO_PORT, &gpioinitstruct);

  /* Configure LCD_RW_PIN pin: LCD Card DC pin */
  gpioinitstruct.Pin = LCD_RD_PIN;
  HAL_GPIO_Init(LCD_RW_GPIO_PORT, &gpioinitstruct);

  /* Configure LCD_RST PIN pin:*/
  gpioinitstruct.Pin = LCD_RST_PIN;
  HAL_GPIO_Init(LCD_RST_GPIO_PORT, &gpioinitstruct);



  /* LCD chip select high */


  /*LCD_GPIO_PORT config */
	 gpioinitstruct.Pin = LCD_DATA_PIN_7;
  HAL_GPIO_Init(LCD_GPIO_PORT,  &gpioinitstruct);
   gpioinitstruct.Pin = LCD_DATA_PIN_6;
  HAL_GPIO_Init(LCD_GPIO_PORT,  &gpioinitstruct);
	 gpioinitstruct.Pin = LCD_DATA_PIN_5;
  HAL_GPIO_Init(LCD_GPIO_PORT,  &gpioinitstruct);
	 gpioinitstruct.Pin = LCD_DATA_PIN_4;                             //10
  HAL_GPIO_Init(LCD_GPIO_PORT,  &gpioinitstruct);
	 gpioinitstruct.Pin = LCD_DATA_PIN_3;                                 //9
  HAL_GPIO_Init(LCD_GPIO_PORT,  &gpioinitstruct);
	 gpioinitstruct.Pin = LCD_DATA_PIN_2;
  HAL_GPIO_Init(LCD_GPIO_PORT,  &gpioinitstruct);
	 gpioinitstruct.Pin = LCD_DATA_PIN_1;
  HAL_GPIO_Init(LCD_GPIO_PORT,  &gpioinitstruct);
	 gpioinitstruct.Pin = LCD_DATA_PIN_0;
  HAL_GPIO_Init(LCD_GPIO_PORT,  &gpioinitstruct);
////

  LCD_CS_HIGH();


  /* LCD SPI Config */
 // SPIx_Init();
}



/**
  * @brief  Writes command to select the LCD register.
  * @param  LCDReg: Address of the selected register.
  * @retval None
  */
void LCD_IO_WriteReg(uint16_t LCDReg)
{
  /* Reset LCD control line CS */
  LCD_CS_LOW();
  
  /* Set LCD data/command line DC to Low */
  LCD_DC_LOW();
	 //LCD_RW_LOW();  
  /* Send Command */
  //SPIx_Write(LCDReg);

	 LCD_PORT_Value(LCDReg >> 8);
   Toggle_LCD_RW();
	//LCD_RW_HIGH();
  //LCD_RW_LOW();  
  /* Send Command */
  //SPIx_Write(LCDReg);

	 LCD_PORT_Value(LCDReg);
   Toggle_LCD_RW();
	//LCD_RW_HIGH();
  /* Deselect : Chip Select high */
  LCD_CS_HIGH();
}


void LCD_IO_WriteData(uint16_t LCDData)
{
  /* Reset LCD control line CS */
  LCD_CS_LOW();
  
  /* Set LCD data/command line DC to Low */
  LCD_DC_HIGH();
	 //LCD_RW_LOW();  
  /* Send Command */
  //SPIx_Write(LCDReg);

	 LCD_PORT_Value(LCDData >> 8);
   Toggle_LCD_RW();
	//LCD_RW_HIGH();
  //LCD_RW_LOW();  
  /* Send Command */
  //SPIx_Write(LCDReg);

	 LCD_PORT_Value(LCDData);
   Toggle_LCD_RW();
	//LCD_RW_HIGH();
  /* Deselect : Chip Select high */
  LCD_CS_HIGH();
}



/**
* @brief  Write register value.
* @param  pData Pointer on the register value
* @param  Size Size of byte to transmit to the register
* @retval None
*/
//void LCD_IO_WriteMultipleData(uint8_t *pData, uint32_t Size)
void LCD_IO_WriteMultipleData(uint16_t *pData, uint32_t Size)
{
  uint32_t counter = 0;
  
  /* Reset LCD control line CS */
  LCD_CS_LOW();
  
  /* Set LCD data/command line DC to High */
  LCD_DC_HIGH();

  if (Size == 1)
  {
    /* Only 1 byte to be sent to LCD - general interface can be used */
    /* Send Data */
   // SPIx_Write(*pData);
		LCD_RW_LOW();
	LCD_PORT_Value((*pData)>>8);
		LCD_RW_HIGH();
  //Toggle_LCD_RW();
		LCD_RW_LOW();
		  LCD_PORT_Value(*pData);
		LCD_RW_HIGH();
  //Toggle_LCD_RW();
  }
  else
{
    /* Several data should be sent in a raw */
    /* Direct SPI accesses for optimization */
    for (counter = Size; counter != 0; counter--)
  {
//       while(((hnucleo_Spi.Instance->SR) & SPI_FLAG_TXE) != SPI_FLAG_TXE)
//   {
// }
//       /* Need to invert bytes for LCD*/
//       *((__IO uint8_t*)&hnucleo_Spi.Instance->DR) = *(pData+1);

//       while(((hnucleo_Spi.Instance->SR) & SPI_FLAG_TXE) != SPI_FLAG_TXE)
// {
// }
//       *((__IO uint8_t*)&hnucleo_Spi.Instance->DR) = *pData;
//       counter--;
//       pData += 2;
  
		
  //Toggle_LCD_RW();
		LCD_RW_LOW();
					LCD_PORT_Value((*pData)>>8);
		LCD_RW_HIGH();
					//Toggle_LCD_RW();
		LCD_RW_LOW();
					LCD_PORT_Value(*pData);
		LCD_RW_HIGH();
					//Toggle_LCD_RW();
					pData += 1;
		  

}  
  
    /* Wait until the bus is ready before releasing Chip select */ 
//    while(((hnucleo_Spi.Instance->SR) & SPI_FLAG_BSY) != RESET)
  
  } 
  /* Deselect : Chip Select high */
  LCD_CS_HIGH();
}






////////////////////////////////////////////lcd parallel 8 bit 


void LCD_PORT_Value(uint32_t value)
{
//uint8_t Mask;

if(value & 0x80) HAL_GPIO_WritePin(LCD_GPIO_PORT, LCD_DATA_PIN_7, GPIO_PIN_SET);
else 	HAL_GPIO_WritePin(LCD_GPIO_PORT, LCD_DATA_PIN_7, GPIO_PIN_RESET);

	if(value & 0x40) HAL_GPIO_WritePin(LCD_GPIO_PORT, LCD_DATA_PIN_6, GPIO_PIN_SET);
else 	HAL_GPIO_WritePin(LCD_GPIO_PORT, LCD_DATA_PIN_6, GPIO_PIN_RESET);
	
	if(value & 0x20) HAL_GPIO_WritePin(LCD_GPIO_PORT, LCD_DATA_PIN_5, GPIO_PIN_SET);
else 	HAL_GPIO_WritePin(LCD_GPIO_PORT, LCD_DATA_PIN_5, GPIO_PIN_RESET);
	
	if(value & 0x10) HAL_GPIO_WritePin(LCD_GPIO_PORT, LCD_DATA_PIN_4, GPIO_PIN_SET);       //10
else 	HAL_GPIO_WritePin(LCD_GPIO_PORT, LCD_DATA_PIN_4, GPIO_PIN_RESET);

	if(value & 0x08) HAL_GPIO_WritePin(LCD_GPIO_PORT, LCD_DATA_PIN_3, GPIO_PIN_SET);       //9
else 	HAL_GPIO_WritePin(LCD_GPIO_PORT, LCD_DATA_PIN_3, GPIO_PIN_RESET);

