salinraj/amigo/syringe pump/src/stm32f1xx_LCD.c
	if(value & 0x04) HAL_GPIO_WritePin(LCD_GPIO_PORT, LCD_DATA_PIN_2, GPIO_PIN_SET);
else 	HAL_GPIO_WritePin(LCD_GPIO_PORT, LCD_DATA_PIN_2, GPIO_PIN_RESET);
	
		if(value & 0x02) HAL_GPIO_WritePin(LCD_GPIO_PORT, LCD_DATA_PIN_1, GPIO_PIN_SET);
else 	HAL_GPIO_WritePin(LCD_GPIO_PORT, LCD_DATA_PIN_1, GPIO_PIN_RESET);
	
	if(value & 0x01) HAL_GPIO_WritePin(LCD_GPIO_PORT, LCD_DATA_PIN_0, GPIO_PIN_SET);
else 	HAL_GPIO_WritePin(LCD_GPIO_PORT, LCD_DATA_PIN_0, GPIO_PIN_RESET);

 // GPIOB->ODR =(GPIOB->ODR & 0x00ff);

 // GPIOB->ODR =(GPIOB->ODR |(value<<8));

//LCD_Delay(50);

}



void Toggle_LCD_RW(void)
{ LCD_Delay(10);
	LCD_RD_HIGH();
	LCD_RW_LOW();
	LCD_Delay(1);
	LCD_RW_HIGH();
	//LCD_Delay(10);
}




// void LCD_Flood(uint16_t color, uint32_t len)
// {
// 	uint32_t  i, hi = color >> 8, lo = color;
// 	LCD_IO_WriteReg(0x0022); // Write data to GRAM

// 	// Write first pixel normally, decrement counter by 1
// 	LCD_CS_LOW();
// 	LCD_DC_HIGH();
// 	for(i=0;i<len;i++)
// 	{
// 	LCD_RW_LOW();
// 	LCD_PORT_Value(hi);
// 		LCD_RW_HIGH();
//   //Toggle_LCD_RW();
// 		LCD_RW_LOW();
// 		  LCD_PORT_Value(lo);
// 		LCD_RW_HIGH();	
// 		
// 	}

// 	
// 	}
	
	
	
	   
void Display_Clear(uint16_t color)   
{   
    int x = 0,y = 0;//,hiByte,lowByte;   
//  printf("Color = %u\r\n", color);   
	
	              LCD_WriteRegister16(0x20, 0x0000);    
                LCD_WriteRegister16(0x21, 0x0000);
								LCD_WriteRegister16(0x22, color); 
	
        while(y<320)   
        {   
            while(x<240)   
            {   
							  //LCD_WriteRegister16(0x20, x);    
               // LCD_WriteRegister16(0x21, y);
	
                LCD_IO_WriteData(color);   
                x++;   
            }   
            x = 0;   
            y++;   
        }   
} 


void Display_Reset(uint16_t color)   
{   
   LCD_CS_HIGH();
   LCD_DC_HIGH();
	 LCD_RW_HIGH();
	
	
	  LCD_CS_LOW();
  
  /* Set LCD data/command line DC to Low for command */
  LCD_DC_LOW();
	 LCD_RW_LOW();
	LCD_PORT_Value(0x00);
	Toggle_LCD_RW();
	Toggle_LCD_RW();
	Toggle_LCD_RW();
	Toggle_LCD_RW();
  LCD_CS_HIGH();     
} 

void LCD_SetRotation(uint8_t x)
{
	
	m_rotation = (x & 3);
	switch(m_rotation) {
	case 0:
	case 2:
		m_width  = TFTWIDTH;
		m_height = TFTHEIGHT;
		break;
	case 1:
	case 3:
		m_width  = TFTHEIGHT;
		m_height = TFTWIDTH;
		break;
	
	}
}


void LCD_SetAddrWindow(int x1, int y1, int x2, int y2)
{

	int x, y, t;
	LCD_CS_LOW();

	// Values passed are in current (possibly rotated) coordinate
	// system.  932X requires hardware-native coords regardless of
	// MADCTL, so rotate inputs as needed.  The address counter is
	// set to the top-left corner -- although fill operations can be
	// done in any direction, the current screen rotation is applied
	// because some users find it disconcerting when a fill does not
	// occur top-to-bottom.
	
	switch(m_rotation) {
	default:
		x  = x1;
		y  = y1;
		break;
	case 1:
		t  = y1;
		y1 = x1;
		x1 = TFTWIDTH  - 1 - y2;
		y2 = x2;
		x2 = TFTWIDTH  - 1 - t;
		x  = x2;
		y  = y1;
		break;
	case 2:
		t  = x1;
		x1 = TFTWIDTH  - 1 - x2;
		x2 = TFTWIDTH  - 1 - t;
		t  = y1;
		y1 = TFTHEIGHT - 1 - y2;
		y2 = TFTHEIGHT - 1 - t;
		x  = x2;
		y  = y2;
		break;
	case 3:
		t  = x1;
		x1 = y1;
		y1 = TFTHEIGHT - 1 - x2;
		x2 = y2;
		y2 = TFTHEIGHT - 1 - t;
		x  = x1;
		y  = y2;
		break;
	}
		
	LCD_WriteRegister16(0x0050, x1); // Set address window
	LCD_WriteRegister16(0x0051, x2);
	LCD_WriteRegister16(0x0052, y1);
	LCD_WriteRegister16(0x0053, y2);
	LCD_WriteRegister16(0x0020, x ); // Set address counter to top left
	LCD_WriteRegister16(0x0021, y );

	LCD_CS_HIGH();
	
}


uint16_t LCD_Color565(uint8_t r, uint8_t g, uint8_t b)
{
  return ((r & 0xF8) << 8) | ((g & 0xFC) << 3) | (b >> 3);
}




void LCD_DrawPixel(int16_t x, int16_t y, uint16_t color)
{
	// Clip	
	int16_t t;
	if((x < 0) || (y < 0) || (x >= TFTWIDTH) || (y >= TFTHEIGHT)) return;

	LCD_CS_LOW();


	switch(m_rotation) {
	case 1:
		t = x;
		x = TFTWIDTH  - 1 - y;
		y = t;
		break;
	case 2:
		x = TFTWIDTH  - 1 - x;
		y = TFTHEIGHT - 1 - y;
		break;
	case 3:
		t = x;
		x = y;
		y = TFTHEIGHT - 1 - t;
		break;
	}

	LCD_WriteRegister16(0x0020, x);
	LCD_WriteRegister16(0x0021, y);
	LCD_WriteRegister16(0x0022, color);

	LCD_CS_HIGH();
}




// void LCD_DrawLine(int16_t x1, int16_t y1, int16_t x2, int16_t y2, uint16_t color)
// {
// 	// Bresenham's algorithm - thx wikpedia
// 	int16_t swap;
// 	int16_t steep;
// 	int16_t dx, dy;
// 	int16_t err ;
// 	int16_t ystep;
// 	err= dx / 2;
// 	dx = abs(x2 - x1);
// 	
// 	dy = abs(y2 - y1);
// 	
// 	/*

// 	 steep = abs(y2 - y1) > abs(x2 - x1);
// 	
// 	if (steep) {
// 		//swap(x1, y1);
// 		//swap(x2, y2);
// 	swap=x1;
// 	x1=y1;
// 	y1=swap;
// 		
// 	swap=x2;
// 	x2=y2;
// 	y2=swap;


// }

// 	if (x1 > x2) {
// 		//swap(x1, x2);
// 		//swap(y1, y2);
// 			swap=x1;
// 			x1=x2;
// 			x2=swap;
// 			swap=y1;
// 			y1=y2;
// 			y2=swap;
// 		
// 		
// 	}

// */

// 	if (y1 < y2) {
// 		ystep = 1;
// 	} else {
// 		ystep = -1;
// 	}

// 	for (; x1<=x2; x1++) {
// 		if (steep) {
// 			LCD_DrawPixel(y1, x1, color);
// 		} else {
// 			LCD_DrawPixel(x1, y1, color);
// 		}
// 		err -= dy;
// 		if (err < 0) {
// 			y1 += ystep;
// 		err += dx;
// 		}
// 	}
// }





void LCD_DrawLine(uint16_t x1, uint16_t y1, uint16_t x2, uint16_t y2, uint16_t color)
{
  int16_t deltax = 0, deltay = 0, x = 0, y = 0, xinc1 = 0, xinc2 = 0, 
  yinc1 = 0, yinc2 = 0, den = 0, num = 0, numadd = 0, numpixels = 0, 
  curpixel = 0;
  
  deltax = abs(x2 - x1);        /* The difference between the x's */
  deltay = abs(y2 - y1);        /* The difference between the y's */
  x = x1;                       /* Start x off at the first pixel */
  y = y1;                       /* Start y off at the first pixel */
  
  if (x2 >= x1)                 /* The x-values are increasing */
  {
    xinc1 = 1;
    xinc2 = 1;
  }
  else                          /* The x-values are decreasing */
  {
    xinc1 = -1;
    xinc2 = -1;
  }
  
  if (y2 >= y1)                 /* The y-values are increasing */
  {
    yinc1 = 1;
    yinc2 = 1;
  }
  else                          /* The y-values are decreasing */
  {
    yinc1 = -1;
    yinc2 = -1;
  }
  
  if (deltax >= deltay)         /* There is at least one x-value for every y-value */
  {
    xinc1 = 0;                  /* Don't change the x when numerator >= denominator */
    yinc2 = 0;                  /* Don't change the y for every iteration */
    den = deltax;
    num = deltax / 2;
    numadd = deltay;
    numpixels = deltax;         /* There are more x-values than y-values */
  }
  else                          /* There is at least one y-value for every x-value */
  {
    xinc2 = 0;                  /* Don't change the x for every iteration */
    yinc1 = 0;                  /* Don't change the y when numerator >= denominator */
    den = deltay;
    num = deltay / 2;
    numadd = deltax;
    numpixels = deltay;         /* There are more y-values than x-values */
  }
  
  for (curpixel = 0; curpixel <= numpixels; curpixel++)
  {
    LCD_DrawPixel(x, y, color);						  /* Draw the current pixel */
    num += numadd;                            /* Increase the numerator by the top of the fraction */
    if (num >= den)                           /* Check if numerator >= denominator */
    {
      num -= den;                             /* Calculate the new numerator value */
      x += xinc1;                             /* Change the x as appropriate */
      y += yinc1;                             /* Change the y as appropriate */
    }
    x += xinc2;                               /* Change the x as appropriate */
    y += yinc2;                               /* Change the y as appropriate */
  }
}





/**
 * \brief Draws a horizontal line
 *
 * \param x			The x-coordinate of the first point
 * \param y			The y-coordinate of the first point
 * \param length	Length of the line
 * \param color	Color
 * 
 * \return void
 */
void LCD_DrawFastHLine(int16_t x, int16_t y, int16_t length, uint16_t color)
{
	int16_t x2;

	// Initial off-screen clipping
	if((length <= 0) || (y <  0) || (y >= m_height) ||
			(x >= m_width) || ((x2 = (x+length-1)) <  0))
		return;

