salinraj/amigo/syringe pump/src/stm32f1xx_LCD.c
		if (cornername & 0x1) {
			LCD_DrawFastVLine(x0+x, y0-y, 2*y+1+delta, color);
			LCD_DrawFastVLine(x0+y, y0-x, 2*x+1+delta, color);
		}
		if (cornername & 0x2) {
			LCD_DrawFastVLine(x0-x, y0-y, 2*y+1+delta, color);
			LCD_DrawFastVLine(x0-y, y0-x, 2*x+1+delta, color);
		}
	}
}

/**
 * \brief Draws a filled rectangle specified by a coordinate pair, a width, and a height.
 * 
 * \param x				The x-coordinate of the upper-left corner of the rectangle to draw
 * \param y				The y-coordinate of the upper-left corner of the rectangle to draw
 * \param w				Width of the rectangle to draw
 * \param h				Height of the rectangle to draw
 * \param fillcolor		Color
 * 
 * \return void
 */
void LCD_FillRect(int16_t x, int16_t y1, int16_t w, int16_t h, uint16_t fillcolor)
{
	int16_t  x2, y2;

	// Initial off-screen clipping
	if( (w <= 0) || (h <= 0) ||
		(x >= m_width) || (y1 >= m_height) ||
		((x2 = x+w-1) <  0) || ((y2  = y1+h-1) <  0))
			return;
	if(x < 0) { // Clip left
		w += x;
		x = 0;
	}
	if(y1 < 0) { // Clip top
		h += y1;
		y1 = 0;
	}
	if(x2 >= m_width) { // Clip right
		x2 = m_width - 1;
		w  = x2 - x + 1;
	}
	if(y2 >= m_height) { // Clip bottom
		y2 = m_height - 1;
		h  = y2 - y1 + 1;
	}

	LCD_SetAddrWindow(x, y1, x2, y2);
	LCD_Flood(fillcolor, (uint32_t)w * (uint32_t)h);
	LCD_SetAddrWindow(0, 0, m_width - 1, m_height - 1);
}

/**
 * \brief Draws a filled rounded rectangle specified by a coordinate pair, a width, and a height.
 * 
 * \param x				The x-coordinate of the upper-left corner of the rectangle to draw
 * \param y				The y-coordinate of the upper-left corner of the rectangle to draw
 * \param w				Width of the rectangle to draw
 * \param h				Height of the rectangle to draw
 * \param r				Radius
 * \param fillcolor		Color
 * 
 * \return void
 */
void LCD_FillRoundRect(int16_t x, int16_t y, int16_t w, int16_t h, int16_t r, uint16_t color)
{
	// smarter version
	LCD_FillRect(x+r, y, w-2*r, h, color);

	// draw four corners
	LCD_FillCircleHelper(x+w-r-1, y+r, r, 1, h-2*r-1, color);
	LCD_FillCircleHelper(x+r    , y+r, r, 2, h-2*r-1, color);
}

/**
 * \brief Fills the screen with the specified color
 * 
 * \param color	Color
 * 
 * \return void
 */
void LCD_FillScreen(uint16_t color)
{
	// For the 932X, a full-screen address window is already the default
	// state, just need to set the address pointer to the top-left corner.
	// Although we could fill in any direction, the code uses the current
	// screen rotation because some users find it disconcerting when a
	// fill does not occur top-to-bottom.
	uint16_t x, y;
	switch(m_rotation) {
		default: x = 0            ; y = 0            ; break;
		case 1 : x = TFTWIDTH  - 1; y = 0            ; break;
		case 2 : x = TFTWIDTH  - 1; y = TFTHEIGHT - 1; break;
		case 3 : x = 0            ; y = TFTHEIGHT - 1; break;
	}
	LCD_CS_LOW();
	LCD_WriteRegister16(0x0020, x);
	LCD_WriteRegister16(0x0021, y);

	LCD_Flood(color, (long)TFTWIDTH * (long)TFTHEIGHT);
}



void LCD_Flood(uint16_t color, uint32_t len)
{
	uint16_t blocks;
	uint8_t  i, hi = color >> 8, lo = color;

	LCD_CS_LOW();
	LCD_DC_LOW();
	LCD_IO_WriteReg(0x0022);

	// Write first pixel normally, decrement counter by 1
	LCD_CS_LOW();
	LCD_DC_HIGH();
	LCD_IO_WriteData(color);
	len--;
	LCD_CS_LOW();
	LCD_DC_HIGH();
	blocks = (uint16_t)(len / 64); // 64 pixels/block
	if(hi == lo) {
		// High and low bytes are identical.  Leave prior data
		// on the port(s) and just toggle the write strobe.
		while(blocks--) {
			i = 16; // 64 pixels/block / 4 pixels/pass
			do {
				Toggle_LCD_RW(); Toggle_LCD_RW(); Toggle_LCD_RW(); Toggle_LCD_RW(); // 2 bytes/pixel
				Toggle_LCD_RW(); Toggle_LCD_RW(); Toggle_LCD_RW(); Toggle_LCD_RW(); // x 4 pixels
			} while(--i);
		}
				// Fill any remaining pixels (1 to 64)
		for(i = (uint8_t)len & 63; i--; ) {
			Toggle_LCD_RW();
			Toggle_LCD_RW();
		}
	} else {
		while(blocks--) {
				i = 16; // 64 pixels/block / 4 pixels/pass
			do {
				LCD_IO_WriteData(color); LCD_IO_WriteData(color);
				LCD_IO_WriteData(color); LCD_IO_WriteData(color);
			} while(--i);
		}
		for(i = (uint8_t)len & 63; i--; ) {
				LCD_IO_WriteData(color);
		}
	}
	LCD_CS_HIGH();
}



/**
 * \brief Print the specified Text
 * 
 * \param fmt	Format text
 * \param 
 * 
 * \return void
 */
void LCD_Printf(const char *fmt, ...)
{
	static char buf[256];
	char *p;
	va_list lst;

	va_start(lst, fmt);
	vsprintf(buf, fmt, lst);
	va_end(lst);

	p = buf;
	while(*p) {
		if (*p == '\n') {
			m_cursor_y += m_textsize*8;
			m_cursor_x  = 0;
		} else if (*p == '\r') {
			// skip em
		} else {
			LCD_DrawChar(m_cursor_x, m_cursor_y, *p, m_textcolor, m_textbgcolor, m_textsize);
			m_cursor_x += m_textsize*6;
			if (m_wrap && (m_cursor_x > (m_width - m_textsize*6))) {
				m_cursor_y += m_textsize*8;
				m_cursor_x = 0;
			}
		}
		p++;
	}
}

/**
 * \brief Resets the Display
 * 
 * \param 
 * 
 * \return void
 */
void LCD_Reset(void)
{
	
	uint8_t i;
	LCD_CS_HIGH();
	LCD_RW_HIGH();
	LCD_RD_HIGH();

	LCD_RST_LOW();
	delay(100);
	LCD_RST_HIGH();

	// Data transfer sync
	LCD_CS_LOW();

	LCD_DC_LOW();
	LCD_IO_WriteReg(0x0000);
	for(i=0; i<2; i++) Toggle_LCD_RW; // Three extra 0x00s
	LCD_CS_HIGH();
}







/**
 * \brief Sets the cursor coordinates
 * 
 * \param x		The x-coordinate
 * \param y		The y-coordinate
 * 
 * \return void
 */
void LCD_SetCursor(unsigned int x, unsigned int y)
{
	m_cursor_x = x;
	m_cursor_y = y;
}

/**
 * \brief Sets the text size
 * 
 * \param s	Size
 * 
 * \return void
 */
void LCD_SetTextSize(uint8_t s)
{
	m_textsize = (s > 0) ? s : 1;
}

/**
 * \brief Sets the text color
 * 
 * \param c		Text color
 * \param b		Background color
 * 
 * \return void
 */
void LCD_SetTextColor(uint16_t c, uint16_t b)
{
	m_textcolor   = c;
	m_textbgcolor = b;
}

/**
 * \brief Set Text wrap
 * 
 * \param w 
 * 
 * \return void
 */
void LCD_SetTextWrap(uint8_t w)
{
	m_wrap = w;
}

/**
 * \brief Set display rotation
 * 
 * \param x	rotation
 * 
 * \return void
 */



void Print_Text_On(uint8_t line, uint8_t position)
{

LCD_SetCursor(position*m_textsize,line);


}

/////////////////////////////////////////////////////////



